In [3]:
import pandas as pd

df=pd.DataFrame({
    'dept':['IT','IT','IT','HR','HR','Sales','Sales','Sales'],
    'name':['A','B','C','D','E','F','G','H'],
    'salary':[5000,6000,4000,3000,3500,7000,7200,7100],
    'age':[25,28,24,30,32,29,31,27]

})

In [4]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args): # number of words
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [ ]:

def filt_avg(x):
    return x['salary'].mean()>5000
display("df.groupby('dept').filter(filt_avg)")

df.groupby('dept').filter(filt_avg)
    dept name  salary  age
5  Sales    F    7000   29
6  Sales    G    7200   31
7  Sales    H    7100   27

In [ ]:
#//////////

def ff(x):
    return len(x)>=3
display("df.groupby('dept').filter(ff)")

df.groupby('dept').filter(ff)
    dept name  salary  age
0     IT    A    5000   25
1     IT    B    6000   28
2     IT    C    4000   24
5  Sales    F    7000   29
6  Sales    G    7200   31
7  Sales    H    7100   27